BAS BMEKZU Project/src/Documents/ИНАГРО_СливТоплива/ИНАГРО_СливТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_СливТоплива</name>
  <registerRecords>AccumulationRegister.ИНАГРО_ТопливоВТС</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПоказанияСпидометраИБака</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВедомостьДвижений</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентВОсновноеТопливо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВОсновномТопливе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСчетУчетаБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/AccumulationRegisters/ИНАГРО_ТопливоВТС/ИНАГРО_ТопливоВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИНАГРО_ТопливоВТС</name>
  <resources>
    <name>КоличествоТоплива</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Топливо</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ПоказанияСпидометраИБака/ИНАГРО_ПоказанияСпидометраИБака.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ПоказанияСпидометраИБака</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПоказанияСпидометра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияБака</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_ВидыДвиженийВедомости/ИНАГРО_ВидыДвиженийВедомости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_ВидыДвиженийВедомости</name>
  <predefined>
    <items>
      <name>ВПроизводство</name>
      <description>В производство</description>
    </items>
    <items>
      <name>Возврат</name>
      <description>Возврат</description>
    </items>
    <items>
      <name>НаВыпойкуПоросятам</name>
      <description>На выпойку поросятам</description>
    </items>
    <items>
      <name>НаВыпойкуТелятам</name>
      <description>На выпойку телятам</description>
    </items>
    <items>
      <name>НаОбщественноеПитание</name>
      <description>На общественное питание</description>
    </items>
    <items>
      <name>Перемещение</name>
      <description>Перемещение</description>
    </items>
    <items>
      <name>Приход</name>
      <description>Приход</description>
    </items>
    <items>
      <name>РеализацияФизическимЛицам</name>
      <description>Реализация физическим лицам</description>
    </items>
    <items>
      <name>РеализацияЮридическимЛицам</name>
      <description>Реализация юридическим лицам</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
  </predefined>
  <attributes>
    <name>ДляМолока</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Documents/ИНАГРО_СливТоплива/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мВалютаРегламентированногоУчета; 

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПоТоварам;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	мВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	// Заголовок для сообщений об ошибках проведения.	
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);;
	
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
		
	КонецЕсли;
			
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область Проведение  

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента) Экспорт
		
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначенияРед12.СформироватьДеревоПолейЗапросаПоШапке();
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Товары".
	СтруктураПолей 			= Новый Структура;
	СтруктураПростыхПолей	= Новый Структура;
	
	СтруктураПолей.Вставить("НомерСтроки",                 "НомерСтроки");
	СтруктураПолей.Вставить("Номенклатура",                "Номенклатура");
	СтруктураПолей.Вставить("Количество",                  "Количество");
	СтруктураПолей.Вставить("КоличествоВОсновномТопливе" , "КоличествоВОсновномТопливе");
	СтруктураПолей.Вставить("СчетУчетаБУ",                 "СчетУчетаБУ");
	СтруктураПолей.Вставить("НовыйСчетУчетаБУ",            "НовыйСчетУчетаБУ");
	СтруктураПолей.Вставить("НалоговоеНазначение",         "НалоговоеНазначение");
	// Поля необходимы для партионного учета
	СтруктураПолей.Вставить("Склад",                       "Ссылка.СкладОтправитель");
	СтруктураПолей.Вставить("СкладНовый",                  "Ссылка.СкладПолучатель");
	СтруктураПолей.Вставить("КорСчетСписанияБУ",           "НовыйСчетУчетаБУ");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ1",      "Номенклатура");
	СтруктураПолей.Вставить("КорСубконтоСписанияБУ2",      "Ссылка.СкладПолучатель");
	
	РезультатЗапросаПоТоварам = ОбщегоНазначенияРед12.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	ТаблицаПоТоварам = ПодготовитьТаблицуПоТоварам(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	
КонецПроцедуры

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуПоТоварам(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаПоТоварам = РезультатЗапросаПоТоварам.Выгрузить();
	
	ТаблицаПоТоварам.Колонки.Добавить("Организация");
	ТаблицаПоТоварам.Колонки.Добавить("ТранспортноеСредство");
	ТаблицаПоТоварам.Колонки.Добавить("СкладОтправитель");
	ТаблицаПоТоварам.Колонки.Добавить("СкладПолучатель");
	ТаблицаПоТоварам.Колонки.Добавить("Регистратор");
	ТаблицаПоТоварам.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаПоТоварам.Колонки.Добавить("ДокументОприходования");
	
	ТаблицаПоТоварам.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,	"Организация");
	ТаблицаПоТоварам.ЗаполнитьЗначения(СтруктураШапкиДокумента.ТранспортноеСредство,	"ТранспортноеСредство");
	ТаблицаПоТоварам.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладОтправитель,	"СкладОтправитель");
	ТаблицаПоТоварам.ЗаполнитьЗначения(СтруктураШапкиДокумента.СкладПолучатель,	"СкладПолучатель");
	ТаблицаПоТоварам.ЗаполнитьЗначения(ЭтотОбъект,   "Регистратор");
	ТаблицаПоТоварам.ЗаполнитьЗначения(Неопределено, "ДоговорКонтрагента");
	ТаблицаПоТоварам.ЗаполнитьЗначения(Неопределено, "ДокументОприходования");
	
	ТаблицаПоТоварам.Колонки.Добавить("НалоговоеНазначениеНовое", Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТаблицаПоТоварам.ЗагрузитьКолонку(ТаблицаПоТоварам.ВыгрузитьКолонку("НалоговоеНазначение") , "НалоговоеНазначениеНовое");
		
	Возврат ТаблицаПоТоварам;

КонецФункции

// Проводит табличные части "Товары" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//	СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	ДвиженияПоРегистрамТранспорта(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	ДвиженияПоРегиструПоказанияСпидометраИБака(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	
	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ() Тогда
		КопияТаблицаПоТоварам = ТаблицаПоТоварам.Скопировать();
		КопияТаблицаПоТоварам.Колонки.Добавить("НаправлениеДвижения");
		КопияТаблицаПоТоварам.ЗаполнитьЗначения(Справочники.ИНАГРО_ВидыДвиженийВедомости.Перемещение, "НаправлениеДвижения");
		ИНАГРО_Общий.ИНАГРО_ВедомостьДвиженийРасход(Движения, КопияТаблицаПоТоварам, СтруктураШапкиДокумента);
		
		КопияТаблицаПоТоварам.Колонки.Склад.Имя = "СкладСтарый";
		КопияТаблицаПоТоварам.Колонки.СкладНовый.Имя = "Склад";
		ИНАГРО_Общий.ИНАГРО_ВедомостьДвиженийПриход(Движения, КопияТаблицаПоТоварам, СтруктураШапкиДокумента);
	КонецЕсли;	
	
	УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(ТаблицаПоТоварам, Отказ, , НСтр("ru='Перемещение ГСМ';uk='Переміщення ПММ'",Локализация.КодЯзыкаИнформационнойБазы()));
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамТранспорта(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	 		
	Для Каждого СтрокаТЧ Из ТаблицаПоТоварам Цикл 
		
		Движение = Движения.ИНАГРО_ТопливоВТС.Добавить(); 		
		Движение.Период 	       = СтруктураШапкиДокумента.Дата;
		Движение.ВидДвижения       = ВидДвиженияНакопления.Расход;		
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);		
		Движение.Организация 	   = СтруктураШапкиДокумента.Организация;
		Движение.ОсновноеСредство  = СтрокаТЧ.ТранспортноеСредство;
		Движение.Топливо 		   = СтрокаТЧ.Номенклатура; 
		Движение.КоличествоТоплива = СтрокаТЧ.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструПоказанияСпидометраИБака(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	ВыборкаПоИтогамТоплива = ПодготовитьТаблицуПоказанийБака().Выбрать();	
	
	Пока ВыборкаПоИтогамТоплива.Следующий() Цикл
				
		Показания = ИНАГРО_Транспорт.ПолучитьПоказанияСпидометраИБака(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.ТранспортноеСредство, СтруктураШапкиДокумента.Ссылка);
		
		Движение = Движения.ИНАГРО_ПоказанияСпидометраИБака.Добавить();
		Движение.Период 		 	 = СтруктураШапкиДокумента.Дата;
		Движение.ОсновноеСредство 	 = СтруктураШапкиДокумента.ТранспортноеСредство;
		Движение.ПоказанияБака		 = Показания.ПоказанияБака - ВыборкаПоИтогамТоплива.КоличествоВОсновномТопливе;     
		Движение.ПоказанияСпидометра = Показания.ПоказанияСпидометра;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьТаблицуПоказанийБака()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СливТоплива.Ссылка.ТранспортноеСредство,
		|	СУММА(СливТоплива.КоличествоВОсновномТопливе) КАК КоличествоВОсновномТопливе
		|ИЗ
		|	Документ.ИНАГРО_СливТоплива.Товары КАК СливТоплива
		|ГДЕ
		|	СливТоплива.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СливТоплива.Ссылка.ТранспортноеСредство";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
